{
  "backend/main.mo": "Implements streak tracking logic with authorization checks, updating streaks based on date comparisons and storing them per user.",
  "feature_evidence.json": "Lists feature evidence metadata mapping features to related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files including hooks, components, and shims.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML bootstrap page mounting the React root element and loading the main module.",
  "frontend/src/App.tsx": "Top-level React component managing navigation between home and learning pages with a theme provider and footer.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation controls, logo, login button, and an authentication error banner.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper applying a textured background with an overlay and centered content area.",
  "frontend/src/components/AuthErrorBanner.tsx": "Displays an alert banner when Internet Identity login fails, showing the associated error message.",
  "frontend/src/components/CompleteSectionButton.tsx": "Button for recording lesson completion with loading state and inline error display on mutation failure.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown selector showing language names and flags, allowing users to switch languages.",
  "frontend/src/components/LessonSectionNav.tsx": "Renders tab-based navigation for lesson sections, highlighting and switching between them.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling authentication states and errors.",
  "frontend/src/components/PronunciationControl.tsx": "UI control to play or stop text-to-speech pronunciation per item using the speech synthesis hook.",
  "frontend/src/components/StreakPanel.tsx": "Displays the user’s daily streak data with loading, error, and unauthenticated states.",
  "frontend/src/data/lessonsSeed.ts": "Defines lesson data structures and English A1 lesson seed content with a helper for generating leveled lessons.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching streak data and recording daily completion with toast notifications.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom hook for browser speech synthesis, supporting playback control, language selection, and error handling.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and base global styles.",
  "frontend/src/lib/cefrLevels.ts": "Defines CEFR level types and a list of level metadata with a default level.",
  "frontend/src/lib/languages.ts": "Provides a list of supported languages with codes, names, and flag paths.",
  "frontend/src/lib/lessonContent.ts": "Retrieves lesson content with fallbacks for missing languages, levels, or sections.",
  "frontend/src/lib/lessonStructure.ts": "Defines lesson section metadata such as IDs, labels, and descriptions.",
  "frontend/src/lib/localDate.ts": "Utilities for generating and formatting local date numbers used for streak tracking.",
  "frontend/src/lib/speechSynthesisLanguages.ts": "Maps language codes to BCP‑47 tags for Web Speech API synthesis.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Displays a grid of selectable languages with flags and names.",
  "frontend/src/pages/LanguageLearningPage.tsx": "Main learning UI with language info, level selection, sections, and lesson content.",
  "frontend/src/shims/processEnv.ts": "Shims process.env for browser use with predefined environment variables.",
  "frontend/src/types/process-env.d.ts": "Adds TypeScript type declarations for process.env in the browser.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind config defining dark mode, content paths, extended color system, animations, and plugins.",
  "project_state.json": "Project metadata describing build/deploy failure issues and existing feature requirements."
}