{
  "backend/main.mo": "Motoko canister managing user streaks with access control, providing query and update methods to read and record daily completions.",
  "feature_evidence.json": "Feature evidence manifest listing feature IDs, involved files, components, and test references for CEFR and language‑related updates.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including pages, components, hooks, and data modules.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens and theme variables for light and dark mode.",
  "frontend/index.html": "HTML entrypoint containing the root div and script loader for the React application.",
  "frontend/src/App.tsx": "Top-level app component controlling navigation between home and learning views with theming support.",
  "frontend/src/components/AppHeader.tsx": "Header component showing navigation controls, branding, and login button.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper adding textured background and centered content container.",
  "frontend/src/components/CompleteSectionButton.tsx": "Button that triggers section completion recording using authentication and mutation hooks.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown for selecting a language with flag icons and metadata from the centralized language list.",
  "frontend/src/components/LessonSectionNav.tsx": "Tabs-based navigation component for switching between lesson sections.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login, logout, and loading states.",
  "frontend/src/components/PronunciationControl.tsx": "Audio pronunciation control using speech synthesis with play/stop behavior and error display.",
  "frontend/src/components/StreakPanel.tsx": "React component displaying streak data with loading and unauthenticated states, pulling data via hooks and formatting stats in a card layout.",
  "frontend/src/data/lessonsSeed.ts": "Defines lesson data structures and provides seeded A1 English lesson content with placeholders for other levels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching streak data and recording daily completions, updating cache and showing toast notifications.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom hook for browser speech synthesis, supporting language-specific voices and tracking speaking state and errors.",
  "frontend/src/index.css": "Tailwind CSS base styles with custom CSS variables for themes and global layout settings.",
  "frontend/src/lib/cefrLevels.ts": "Defines CEFR level types, metadata, and the default level used across the app.",
  "frontend/src/lib/languages.ts": "Defines a Language interface and a list of 20 European languages with codes, names, native names, and flag image paths.",
  "frontend/src/lib/lessonContent.ts": "Fetches lesson content by language, section, and CEFR level, returning placeholders when data is missing.",
  "frontend/src/lib/lessonStructure.ts": "Defines lesson sections and their labels and descriptions for structuring course content.",
  "frontend/src/lib/localDate.ts": "Provides utilities for generating a YYYYMMDD date number and formatting streak dates into readable labels.",
  "frontend/src/lib/speechSynthesisLanguages.ts": "Maps internal language codes to corresponding BCP-47 tags for the Web Speech API.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider, rendering the main App component.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with language selection cards allowing users to pick a language to study.",
  "frontend/src/pages/LanguageLearningPage.tsx": "Displays the main learning interface with level selection, section navigation, lesson content, and language switching.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, plugins, and container settings for the frontend UI.",
  "project_state.json": "Defines the app’s state, supported languages, CEFR-level plans, UI asset requirements, and existing implemented features for the Euro 20 language-learning app. Includes metadata, architectural notes, and required flag images."
}