{
  "backend/main.mo": "Motoko canister managing user streak data with access control, allowing users or admins to record daily completions and computing streak updates.",
  "feature_evidence.json": "Feature evidence report listing pronunciation-related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short summaries of key frontend pronunciation and language‑learning related files.",
  "frontend/index.css": "Tailwind-based global CSS defining theme variables for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML file providing the root element and loading the React entry script.",
  "frontend/src/App.tsx": "Top-level React app handling navigation between the home page and language learning page with theming support.",
  "frontend/src/components/AppHeader.tsx": "Header component showing navigation controls, branding, and login button.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper applying background texture, overlay, and centered content region.",
  "frontend/src/components/CompleteSectionButton.tsx": "Button that records lesson section completion using authenticated identity and mutation hooks.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown component for selecting a learning language from the supported list.",
  "frontend/src/components/LessonSectionNav.tsx": "Tab-based navigation for switching between lesson sections.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication with loading states.",
  "frontend/src/components/PronunciationControl.tsx": "Button control for playing or stopping text-to-speech pronunciation with error feedback.",
  "frontend/src/components/StreakPanel.tsx": "React component that displays the user’s daily streak, best streak, and last completion date using streak query data.",
  "frontend/src/data/lessonsSeed.ts": "Defines lesson content structures and provides seeded English lesson data across multiple categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching streak data and recording daily completions with toast notifications.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Hook wrapping browser speech synthesis with language selection, status tracking, and error handling.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode tokens, and base font settings.",
  "frontend/src/lib/languages.ts": "Exports a list of supported languages with codes, English names, and native names.",
  "frontend/src/lib/lessonContent.ts": "Retrieves lesson content for a given language and section, falling back to default messages when missing.",
  "frontend/src/lib/lessonStructure.ts": "Defines the LessonSection interface and a list of five predefined lesson sections used throughout the app.",
  "frontend/src/lib/localDate.ts": "Provides utilities to get the current local date as YYYYMMDD and format streak dates into readable labels.",
  "frontend/src/lib/speechSynthesisLanguages.ts": "Maps internal language codes to BCP‑47 tags for Web Speech API pronunciation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a grid of selectable languages and app branding.",
  "frontend/src/pages/LanguageLearningPage.tsx": "Displays lessons for a selected language with navigation, content rendering, and pronunciation controls.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins.",
  "project_state.json": "Describes the project’s metadata, features, architecture notes, and versioned state."
}