{
  "kind": "build_request",
  "title": "Add voice pronunciation (text-to-speech) for lesson items across all languages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add a voice pronunciation control for each lesson item in the LanguageLearningPage so users can play audio for the item’s native text using the browser’s built-in text-to-speech (Web Speech API).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you please add voice pronounciaton to each language"
        ]
      },
      "acceptanceCriteria": [
        "Each lesson item that has a non-empty `native` string displays a clearly labeled Play control (e.g., a button) next to the native text.",
        "Clicking Play speaks the item’s `native` text out loud using `window.speechSynthesis` (no backend calls).",
        "If an item has no `native` text, no Play control is shown for that item.",
        "User-facing error/empty states are shown in English if speech is unavailable or fails (e.g., 'Voice pronunciation is not supported in this browser')."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Select an appropriate speech synthesis language/voice per supported language by mapping the app’s language codes (from `frontend/src/lib/languages.ts`) to BCP-47 language tags and using those tags when creating utterances.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add voice pronounciaton to each language"
        ]
      },
      "acceptanceCriteria": [
        "A centralized mapping exists for all 20 supported language codes to BCP-47 tags (e.g., de->de-DE, fr->fr-FR, etc.).",
        "When Play is pressed, the utterance uses the mapped language tag (`utterance.lang = ...`) for the currently selected language.",
        "If no matching voice is available for the mapped language tag, the app falls back gracefully (e.g., uses default voice) and remains functional."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Provide basic playback UX for pronunciation so users can stop/interrupt speech and avoid overlapping audio when multiple items are played.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add voice pronounciaton"
        ]
      },
      "acceptanceCriteria": [
        "Starting a new pronunciation cancels any currently playing speech before beginning the new utterance.",
        "A Stop control is available while speech is playing (or Play toggles to Stop), and Stop immediately cancels playback.",
        "The UI prevents repeated rapid clicks from causing overlapping or queued utterances (e.g., by cancelling before speaking and reflecting playing state)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Do not add external AI/LLM or third-party TTS services; use only in-browser capabilities."
  ],
  "nonGoals": [
    "Do not add recorded audio files for every phrase.",
    "Do not require backend changes or persistence for voice settings unless explicitly requested later.",
    "Do not implement real-time audio streaming or server-generated audio."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}