{
  "kind": "build_request",
  "title": "Add CEFR levels (A1–C2) for all languages and display a flag per language",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Add CEFR level support (A1, A2, B1, B2, C1, C2) across the lesson content model so lesson content is addressable by language + CEFR level + section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "ok great now make all 20 languages have a1 a2 b1 b2 and c1 c2 levels also add the countries flag for every langage"
        ]
      },
      "acceptanceCriteria": [
        "A CEFR level list exists in the frontend and includes exactly: A1, A2, B1, B2, C1, C2.",
        "Lesson content lookup supports querying by (languageCode, levelId, sectionId).",
        "Existing A1 content continues to render correctly for all languages (no regressions vs current A1-only behavior)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update the seeded lesson dataset to include CEFR levels for all 20 supported languages, using the current content as the A1 level and providing valid (non-crashing) content entries for A2, B1, B2, C1, and C2 for every language and section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "make all 20 languages have a1 a2 b1 b2 and c1 c2 levels"
        ]
      },
      "acceptanceCriteria": [
        "For each language code in frontend/src/lib/languages.ts, the seed dataset contains entries for levels A1, A2, B1, B2, C1, C2.",
        "For each (language, level), all existing sections (alphabet, greetings, numbers, common, sentences) resolve to a LessonContent object with an items array (can be empty if content is not yet available).",
        "The app never shows 'Content not available for this language/section' for any supported (language, level, section) combination."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add a CEFR level selector to the language learning experience and wire it so switching levels updates the displayed lesson content while keeping the existing section navigation behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "make all 20 languages have a1 a2 b1 b2 and c1 c2 levels"
        ]
      },
      "acceptanceCriteria": [
        "LanguageLearningPage provides a visible control to select A1, A2, B1, B2, C1, C2.",
        "Changing the selected level updates the rendered introduction and items for the current section.",
        "Section navigation continues to work within the selected level.",
        "User-facing text added for the level selector is in English."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add a country flag static asset for each of the 20 supported languages and display the flag in the home language grid and in the language switcher dropdown (and/or current selection display).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "also add the countries flag for every langage"
        ]
      },
      "acceptanceCriteria": [
        "Each supported language has a corresponding flag image available as a frontend static asset under frontend/public/assets/generated.",
        "HomePage language cards display each language’s flag instead of the generic globe icon (or alongside it) without layout breakage on mobile and desktop.",
        "LanguageSwitcher shows each language’s flag in the dropdown list and for the currently selected language.",
        "No flag images are served via the backend."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Extend the supported language metadata to include a flag asset reference per language so UI components can consistently render flags from the centralized language definition.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add the countries flag for every langage"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/lib/languages.ts exports language entries that include a stable reference to the flag asset for that language.",
        "All flag rendering in HomePage/LanguageSwitcher uses the centralized language metadata rather than hardcoded per-component mappings."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend must remain a single Motoko actor (no new backend canisters/services).",
    "Do not fetch flag images from third-party APIs/CDNs at runtime; use bundled static assets."
  ],
  "nonGoals": [
    "Adding new languages beyond the existing 20.",
    "Changing the daily streak backend logic or schema (unless strictly required to prevent breakage; not expected).",
    "Implementing third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [
      "United Kingdom flag (flag-uk.dim_64x64.png)",
      "Germany flag (flag-de.dim_64x64.png)",
      "France flag (flag-fr.dim_64x64.png)",
      "Spain flag (flag-es.dim_64x64.png)",
      "Italy flag (flag-it.dim_64x64.png)",
      "Portugal flag (flag-pt.dim_64x64.png)",
      "Netherlands flag (flag-nl.dim_64x64.png)",
      "Sweden flag (flag-sv.dim_64x64.png)",
      "Norway flag (flag-no.dim_64x64.png)",
      "Denmark flag (flag-da.dim_64x64.png)",
      "Finland flag (flag-fi.dim_64x64.png)",
      "Poland flag (flag-pl.dim_64x64.png)",
      "Czech Republic flag (flag-cs.dim_64x64.png)",
      "Hungary flag (flag-hu.dim_64x64.png)",
      "Romania flag (flag-ro.dim_64x64.png)",
      "Bulgaria flag (flag-bg.dim_64x64.png)",
      "Greece flag (flag-el.dim_64x64.png)",
      "Ukraine flag (flag-uk.dim_64x64.png)",
      "Ireland flag (flag-ga.dim_64x64.png)",
      "Slovakia flag (flag-sk.dim_64x64.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}